app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("description", "created_at", "updated_at", "created_by_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "asdsad"], ["created_at", "2022-09-28 03:38:25.081850"], ["updated_at", "2022-09-28 03:38:25.081850"], ["created_by_id", 1]]
---
  def create
    @post = Post.new(post_params)

    if @post.save