app/controllers/users_controller.rb

  def update
    if current_user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2022-10-01 21:00:04.905049"], ["id", 1]]